# Exploratory Data Analysis

In [1]:
# Importing the libraries

import numpy as np
import matplotlib.pyplot as plt
import pandas as pd

In [2]:
# Define settings
import os

pd.set_option("display.precision", 3)
data_dir_path = os.getcwd() + '/dataverse_files/'

In [3]:
# Importing data
import pyreadr

croissance_et_climat_decadaires = pyreadr.read_r(data_dir_path + "croissance_et_climat_decadaires.rds" ).popitem()[1]
valorisation_annuelle = pyreadr.read_r(data_dir_path + "valorisation_annuelle.rds" ).popitem()[1]

## Analysis of growths and decadal climates

In [339]:
df = croissance_et_climat_decadaires

In [340]:
df.head()

,ucs,safran,sol,type_de_prairie,gestion,annee,decade,Tmin,Tmax,Tmoy,Rain,RG,im,croissance
0,789,2131,330343,tp3,20,1985.0,1.0,-2.289,3.178,0.444,12.3,28.912,43.573,0.032
1,789,2131,330343,tp3,20,1985.0,2.0,-5.740,-0.410,-3.075,19.5,33.793,104.188,0.000
2,789,2131,330343,tp3,20,1985.0,3.0,3.770,9.130,6.450,36.8,24.751,82.772,0.046
3,789,2131,330343,tp3,20,1985.0,4.0,8.230,12.450,10.340,14.4,32.975,26.195,0.075
4,789,2131,330343,tp3,20,1985.0,5.0,-1.380,2.520,0.570,25.3,48.912,88.562,0.015

In [341]:
print(df.shape)
print(df.columns)
print(df.info())

(18693829, 14)
Index(['ucs', 'safran', 'sol', 'type_de_prairie', 'gestion', 'annee', 'decade',
       'Tmin', 'Tmax', 'Tmoy', 'Rain', 'RG', 'im', 'croissance'],
      dtype='object')
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 18693829 entries, 0 to 18693828
Data columns (total 14 columns):
 #   Column           Dtype
---  ------           -----
 0   ucs              int32
 1   safran           int32
 2   sol              int32
 3   type_de_prairie  object
 4   gestion          int32
 5   annee            float64
 6   decade           float64
 7   Tmin             float64
 8   Tmax             float64
 9   Tmoy             float64
 10  Rain             float64
 11  RG               float64
 12  im               float64
 13  croissance       float64
dtypes: float64(9), int32(4), object(1)
memory usage: 1.7+ GB
None

In [342]:
df.describe(include= "all")

,ucs,safran,sol,type_de_prairie,gestion,annee,decade,Tmin,Tmax,Tmoy,Rain,RG,im,croissance
count,1.869e+07,1.869e+07,1.869e+07,18693829,1.869e+07,1.867e+07,1.867e+07,1.857e+07,1.857e+07,1.857e+07,1.857e+07,1.857e+07,1.857e+07,1.867e+07
unique,NaN,NaN,NaN,3,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
top,NaN,NaN,NaN,tp4,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
freq,NaN,NaN,NaN,10563388,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
mean,1.054e+03,2.523e+03,3.308e+05,NaN,1.362e+01,1.999e+03,1.900e+01,8.249e+00,1.464e+01,1.145e+01,2.578e+01,1.085e+02,4.798e+01,3.710e+01
std,2.229e+02,5.508e+02,6.531e+02,NaN,9.407e+00,8.626e+00,1.068e+01,4.365e+00,5.607e+00,4.893e+00,2.499e+01,6.581e+01,4.897e+01,3.066e+01
min,6.400e+02,1.309e+03,3.303e+05,NaN,1.000e+00,1.984e+03,1.000e+00,-8.760e+00,-5.380e+00,-7.020e+00,0.000e+00,7.170e+00,0.000e+00,0.000e+00
25%,8.880e+02,2.120e+03,3.306e+05,NaN,5.000e+00,1.991e+03,1.000e+01,5.040e+00,1.043e+01,7.855e+00,6.800e+00,4.684e+01,1.144e+01,1.090e+01
50%,1.080e+03,2.497e+03,3.306e+05,NaN,1.500e+01,1.999e+03,1.900e+01,8.290e+00,1.425e+01,1.118e+01,1.890e+01,1.043e+02,3.297e+01,2.812e+01
75%,1.222e+03,2.895e+03,3.306e+05,NaN,2.100e+01,2.006e+03,2.800e+01,1.191e+01,1.910e+01,1.554e+01,3.720e+01,1.615e+02,6.876e+01,5.997e+01
max,1.610e+03,3.886e+03,3.327e+05,NaN,3.000e+01,2.013e+03,3.700e+01,2.069e+01,3.117e+01,2.530e+01,2.404e+02,2.990e+02,5.007e+02,1.424e+02

In [343]:
df[["ucs", "safran", "sol"]].corr()

          ucs  safran    sol
ucs     1.000   0.937  0.085
safran  0.937   1.000  0.032
sol     0.085   0.032  1.000

### Feature selection

In [362]:
# sol as PCU ?
valuable_columns = ["sol", "annee", "decade", "Tmin", "Tmax", "Tmoy", "Rain", "RG", "im", "croissance"]
df = croissance_et_climat_decadaires[valuable_columns]

In [363]:
df.head()

,sol,annee,decade,Tmin,Tmax,Tmoy,Rain,RG,im,croissance
0,330343,1985.0,1.0,-2.289,3.178,0.444,12.3,28.912,43.573,0.032
1,330343,1985.0,2.0,-5.740,-0.410,-3.075,19.5,33.793,104.188,0.000
2,330343,1985.0,3.0,3.770,9.130,6.450,36.8,24.751,82.772,0.046
3,330343,1985.0,4.0,8.230,12.450,10.340,14.4,32.975,26.195,0.075
4,330343,1985.0,5.0,-1.380,2.520,0.570,25.3,48.912,88.562,0.015

In [364]:
df.shape

(18693829, 10)

In [365]:
(df.isna() | df.isnull()).sum()

sol                0
annee          20262
decade         20262
Tmin          126008
Tmax          126008
Tmoy          126008
Rain          126008
RG            126008
im            126008
croissance     20262
dtype: int64

### 10-year average

In [366]:
df_10y = df.groupby(["sol", "annee", "decade"]).sample(n=10, replace=True)
df_10y = df_10y.groupby(["sol", "annee", "decade"]).mean()
df = df_10y.reset_index()

In [367]:
df.head()

,sol,annee,decade,Tmin,Tmax,Tmoy,Rain,RG,im,croissance
0,330343,1984.0,1.0,4.360,8.740,6.550,27.663,29.479,61.847,2.433
1,330343,1984.0,2.0,4.141,9.165,6.653,47.712,25.632,106.340,2.007
2,330343,1984.0,3.0,3.219,8.353,5.786,48.570,41.975,113.687,2.087
3,330343,1984.0,4.0,6.646,10.605,8.625,29.620,36.488,58.877,5.457
4,330343,1984.0,5.0,-0.412,6.970,3.279,0.410,97.111,1.195,4.105

In [368]:
df.describe()

,sol,annee,decade,Tmin,Tmax,Tmoy,Rain,RG,im,croissance
count,26640.000,26640.000,26640.000,26640.000,26640.000,26640.000,26640.000,26640.000,26640.000,26640.000
mean,331246.125,1998.500,19.000,8.326,14.679,11.502,25.166,108.532,46.621,36.240
std,965.872,8.656,10.677,4.294,5.513,4.820,22.901,65.171,44.761,28.361
min,330343.000,1984.000,1.000,-7.133,-3.274,-5.064,0.000,8.488,0.000,0.000
25%,330506.500,1991.000,10.000,5.140,10.494,7.929,7.490,47.459,12.575,11.987
50%,330598.500,1998.500,19.000,8.370,14.319,11.240,19.315,104.861,33.657,28.627
75%,332378.250,2006.000,28.000,11.971,19.145,15.578,36.440,160.483,67.221,56.786
max,332668.000,2013.000,37.000,19.287,30.250,24.554,199.570,297.139,405.879,132.326

### Reshape the dataframe

In [369]:
df["annee"] = df["annee"].astype("int64")
df["decade"] = df["decade"].astype("int64")

In [370]:
dfgroup = df
dfgroup.head()

,sol,annee,decade,Tmin,Tmax,Tmoy,Rain,RG,im,croissance
0,330343,1984,1,4.360,8.740,6.550,27.663,29.479,61.847,2.433
1,330343,1984,2,4.141,9.165,6.653,47.712,25.632,106.340,2.007
2,330343,1984,3,3.219,8.353,5.786,48.570,41.975,113.687,2.087
3,330343,1984,4,6.646,10.605,8.625,29.620,36.488,58.877,5.457
4,330343,1984,5,-0.412,6.970,3.279,0.410,97.111,1.195,4.105

In [371]:
dfgroup = dfgroup.groupby(["sol", "annee"]).count()
dfgroup.head()

              decade  Tmin  Tmax  Tmoy  Rain  RG  im  croissance
sol    annee
330343 1984       37    37    37    37    37  37  37          37
       1985       37    37    37    37    37  37  37          37
       1986       37    37    37    37    37  37  37          37
       1987       37    37    37    37    37  37  37          37
       1988       37    37    37    37    37  37  37          37

In [372]:
df.describe()

,sol,annee,decade,Tmin,Tmax,Tmoy,Rain,RG,im,croissance
count,26640.000,26640.000,26640.000,26640.000,26640.000,26640.000,26640.000,26640.000,26640.000,26640.000
mean,331246.125,1998.500,19.000,8.326,14.679,11.502,25.166,108.532,46.621,36.240
std,965.872,8.656,10.677,4.294,5.513,4.820,22.901,65.171,44.761,28.361
min,330343.000,1984.000,1.000,-7.133,-3.274,-5.064,0.000,8.488,0.000,0.000
25%,330506.500,1991.000,10.000,5.140,10.494,7.929,7.490,47.459,12.575,11.987
50%,330598.500,1998.500,19.000,8.370,14.319,11.240,19.315,104.861,33.657,28.627
75%,332378.250,2006.000,28.000,11.971,19.145,15.578,36.440,160.483,67.221,56.786
max,332668.000,2013.000,37.000,19.287,30.250,24.554,199.570,297.139,405.879,132.326

In [373]:
df.nunique()

sol              24
annee            30
decade           37
Tmin          15361
Tmax          16945
Tmoy          20016
Rain           9431
RG            26418
im            26393
croissance    26521
dtype: int64

In [374]:
(df.isna() | df.isnull()).sum()

sol           0
annee         0
decade        0
Tmin          0
Tmax          0
Tmoy          0
Rain          0
RG            0
im            0
croissance    0
dtype: int64

In [375]:
croissance_et_climat_decadaires_preprocessed = df

## Feature selection of annual valuations

In [382]:
df = valorisation_annuelle

In [383]:
df.head()

,ucs,safran,sol,type_de_prairie,gestion,annee,valorisation,RU,cumul_croissance
0,1005,2245,330562,tp3,15,1985.0,4.964,97.42,8.757
1,1005,2245,330562,tp3,15,1986.0,8.173,97.42,14.620
2,1005,2245,330562,tp3,15,1987.0,12.666,97.42,16.287
3,1005,2245,330562,tp3,15,1989.0,5.825,97.42,9.063
4,1005,2245,330562,tp3,15,1990.0,7.212,97.42,11.758

In [398]:
valuable_columns = ["sol", "annee", "cumul_croissance"]
df = valorisation_annuelle[valuable_columns]

In [399]:
(df.isna() | df.isnull()).sum()

sol                 0
annee               0
cumul_croissance    0
dtype: int64

### Reshape the dataframe

In [400]:
df = df.reset_index(drop=True)
df[["annee"]] = df[["annee"]].astype("int64")

In [402]:
df.head()

      sol  annee  cumul_croissance
0  330562   1985             8.757
1  330562   1986            14.620
2  330562   1987            16.287
3  330562   1989             9.063
4  330562   1990            11.758

In [403]:
df.describe()

              sol       annee  cumul_croissance
count  535406.000  535406.000        535406.000
mean   330824.012    1998.691            13.771
std       652.279       8.625             3.777
min    330343.000    1984.000             0.754
25%    330556.000    1991.000            11.155
50%    330563.000    1999.000            13.813
75%    330638.000    2006.000            16.441
max    332668.000    2013.000            26.845

In [404]:
valorisation_annuelle_preprocessed = df

## Concatenation

In [412]:
X = croissance_et_climat_decadaires_preprocessed.merge(valorisation_annuelle_preprocessed, how='right', on=["sol", "annee"])
#[
#    croissance_et_climat_decadaires_preprocessed.loc[:, ["sol", "annee", "decade", "Tmin", "Tmax", "Tmoy", "Rain", "RG", "im", "croissance"]],
#    valorisation_annuelle_preprocessed.loc[:, ["sol", "annee", "cumul_croissance"]]
#    ]
#y = df.loc[:, ["cumul_croissance"]].values.astype(float)
X

,sol,annee,decade,Tmin,Tmax,Tmoy,Rain,RG,im,croissance,cumul_croissance
0,330562,1985,1,-2.469,2.649,0.090,11.370,34.941,40.947,1.626,8.757
1,330562,1985,2,-5.949,-0.489,-3.219,20.730,31.961,112.320,0.100,8.757
2,330562,1985,3,3.502,8.492,5.997,55.533,24.470,127.971,5.773,8.757
3,330562,1985,4,7.921,11.343,9.632,14.890,36.340,28.279,21.971,8.757
4,330562,1985,5,-0.337,2.970,1.317,33.590,46.650,108.607,6.008,8.757
...,...,...,...,...,...,...,...,...,...,...,...
19810017,330563,2013,33,4.050,8.046,6.048,24.200,31.805,56.089,7.619,11.723
19810018,330563,2013,34,3.246,8.283,5.764,2.450,30.156,5.661,5.094,11.723
19810019,330563,2013,35,2.180,8.217,5.199,5.090,39.567,12.497,6.870,11.723
19810020,330563,2013,36,6.543,10.685,8.614,99.760,22.958,197.960,13.085,11.723
19810021,330563,2013,37,5.480,10.408,7.944,44.260,17.824,91.498,13.194,11.723

In [413]:
X.describe()

,sol,annee,decade,Tmin,Tmax,Tmoy,Rain,RG,im,croissance,cumul_croissance
count,1.981e+07,1.981e+07,1.981e+07,1.981e+07,1.981e+07,1.981e+07,1.981e+07,1.981e+07,1.981e+07,1.981e+07,1.981e+07
mean,3.308e+05,1.999e+03,1.900e+01,8.250e+00,1.464e+01,1.144e+01,2.581e+01,1.085e+02,4.805e+01,3.719e+01,1.377e+01
std,6.523e+02,8.625e+00,1.068e+01,4.311e+00,5.544e+00,4.851e+00,2.328e+01,6.488e+01,4.573e+01,2.844e+01,3.777e+00
min,3.303e+05,1.984e+03,1.000e+00,-7.133e+00,-3.274e+00,-5.064e+00,0.000e+00,8.488e+00,0.000e+00,0.000e+00,7.538e-01
25%,3.306e+05,1.991e+03,1.000e+01,5.042e+00,1.043e+01,7.854e+00,7.850e+00,4.754e+01,1.316e+01,1.255e+01,1.116e+01
50%,3.306e+05,1.999e+03,1.900e+01,8.289e+00,1.427e+01,1.115e+01,1.988e+01,1.057e+02,3.450e+01,3.024e+01,1.381e+01
75%,3.306e+05,2.006e+03,2.800e+01,1.193e+01,1.914e+01,1.554e+01,3.749e+01,1.609e+02,6.965e+01,5.849e+01,1.644e+01
max,3.327e+05,2.013e+03,3.700e+01,1.929e+01,3.025e+01,2.455e+01,1.996e+02,2.971e+02,4.059e+02,1.323e+02,2.684e+01